var consts = {
	'hint': {'nothing':'<<<尚未起运>>>'},
	'_5': [
{'name':'木', 'over':'丰姿秀丽，骨骼修长，手足细腻，口尖发美，面色清白', 'under':'个子瘦长，头发稀少', 'insideover':'有博爱恻隐之心，慈祥恺悌之意，清高慷慨，质朴无伪', 'insideunder':'性格偏狭，嫉妒不仁', 'organ':'肝、胆', 'outlook':'头、肩', 'pos':'东', 'work':'木材、木器、家具、装潢、木成品、纸业、种植业、养花业、育树苗、敬神物品、香料、植物性素食品等'},
{'name':'火', 'over':'头小脚长，上尖下阔，浓眉小耳，精神闪烁', 'under':'黄瘦尖楞', 'insideover':'谦和恭敬，淳朴急躁', 'insideunder':'语言妄诞，诡诈妒毒，做事有始无终', 'organ':'心、小肠', 'outlook':'齿舌、额头', 'pos':'南', 'work':'放光、照明、照光、光学、高热、液热、易烧易燃、油类、酒精类热炊食、食品、理发、化妆品、人身装饰品、文艺、文学、文具、文化学生、文人、作家、写作、教员、校长、秘书、出版、公务、政界等'},
{'name':'土', 'over':'圆腰阔鼻，眉清目秀，口才声重', 'under':'面色忧滞，面扁鼻低', 'insideover':'忠孝至诚，肚量宽厚，言必信，行必果，但须注意头脑僵化，愚拙不明', 'insideunder':'狠毒乖戾，不讲信用，不讲情理', 'organ':'脾、胃', 'outlook':'鼻面', 'pos':'中央之地，本地', 'work':'土产、地产、农村、畜牧兽类农人等类、布匹、服装、纺织、石、石灰、山地、水泥、建筑、房产买卖、挡水的雨衣、雨伞、雨帆、筑提、容水物品、当铺、古董、中间人、律师、管理、买卖、设计、顾问、丧业、筑墓、墓地管理、僧尼等'},
{'name':'金', 'over':'骨肉相称，面方白净，眉高眼深，体健神清', 'under':'身材瘦小', 'insideover':'果断则毅，疏财仗义，深知廉耻，但须注意有勇无谋，贪欲不仁', 'insideunder':'刻薄，喜淫，吝啬贪婪', 'organ':'肺、大肠', 'outlook':'胸、筋', 'pos':'西', 'work':'精纤材料或金属材料、坚硬、决断、武术、鉴定、清官、总管、汽车、交通、金融、工程、种子、开矿、民意代表、伐木、机械等'},
{'name':'水', 'over':'面黑有彩，语言清和', 'under':'人物短小', 'insideover':'深思熟虑，足智多谋，学识过人，但须注意好说是非、飘荡贪淫', 'insideunder':'性情无常，胆小无略，行事反复', 'organ':'肾、膀胱', 'outlook':'足、胫', 'pos':'北', 'work':'航海、冷温不燃液体、冰水、鱼类、水产、水利、水物、冷藏、冷冻、打捞、洁洗、扫除、流水、港内、泳池、湖池塘、浴池、冷食物买卖、漂流、奔波、流动、连续性、易变化、属水性质、音响性质、清洁性质、冷温不燃性化学、海上作业、迁旅、特技表演、运动、导游、旅行、玩具、魔术、采访记者、侦探、旅社、灭火器具、医药业、药物经营、医生、护士、占卜等'}
	],
	'_10': [
{'name':'正官', 'inside':'正直负责，端庄严肃，循规蹈矩，但易流于刻板、墨守成规，反为意志不坚'},
{'name':'七杀', 'inside':'豪爽侠义，积极进取，威严机敏，但易流于偏激，叛逆霸道，反为堕落极端'},
{'name':'正印', 'inside':'聪颖仁慈，淡泊名利，逆来顺受，但易流于庸碌，缺乏进取，反为迟钝消极'},
{'name':'偏印', 'inside':'精明干练，反应机警，多才多艺，但易流于孤独，缺乏人情，反为自私冷漠'},
{'name':'正财', 'inside':'勤劳节俭，踏实保守，任劳任怨，但易流于苟且，缺乏进取，反为懦弱无能'},
{'name':'偏财', 'inside':'慷慨重情，聪敏机灵，乐观开朗，但易流于虚浮，缺乏节制，反为浮华风流'},
{'name':'食神', 'inside':'温文随和，待人宽厚，善良体贴，但易流于虚伪，缺乏是非，反为迂腐懦怯'},
{'name':'伤官', 'inside':'聪明活跃，才华横溢，逞强好胜，但易流于任性，缺乏约束，反为桀傲不驯'},
{'name':'比肩', 'inside':'稳健刚毅，冒险勇敢，积极进取，但易流于孤僻，缺乏合群，反为孤立寡合'},
{'name':'劫财', 'inside':'热诚坦直，坚韧志旺，奋斗不屈，但易流于盲目，缺乏理智，反为蛮横冲动'}
	]
};